Обработки/Reports/_РасшифровкаСтоимостиАктивовДляГруппыБудущего.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РасшифровкаСтоимостиАктивовДляГруппыБудущего</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиенты</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезУчетаРасчетаПоПисьмуЦБ0185316</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РасшифровкаСтоимостиАктивовДляГруппыБудущего/Ext/ObjectModule.bsl
Перем ДополнительныеСвойства Экспорт;

#Область Интерфейс_внешнего_отчета

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Расшифровка стоимости активов для группы Будущего",
		"0.15",
		"",
		Истина);
		
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ФормированиеИОтправкаОтчета", "Формирование и отправка отчета", , Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Интерфейс для запуска обработки
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("Источник", ПараметрыОбработки.ДополнительнаяОбработкаСсылка);
	
	// Заполнение реквизитов обработки
	
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыКоманды); 
	
	Если ПараметрыКоманды.Свойство("Клиенты") И ТипЗнч(ПараметрыКоманды.Клиенты) = Тип("Массив") Тогда
		ЭтотОбъект.Клиенты.ЗагрузитьЗначения(ПараметрыКоманды.Клиенты);	
	КонецЕсли;
	
	// Обработка команд
	
	Если ИдентификаторКоманды = "ФормированиеИОтправкаОтчета" Тогда
		
		#Область Обработка_команды
		
		Если Не ПараметрыКоманды.Свойство("Получатели") ИЛИ Не ЗначениеЗаполнено(ПараметрыКоманды.Получатели) Тогда
			ЗарегистрироватьОшибки("Не заполнен обязательный параметр: 'Получатели'");
			Возврат;
		КонецЕсли;
		
		Если Не ПараметрыКоманды.Свойство("ПолучателиОшибок") ИЛИ Не ЗначениеЗаполнено(ПараметрыКоманды.ПолучателиОшибок) Тогда
			ЗарегистрироватьОшибки("Не заполнен обязательный параметр: 'ПолучателиОшибок'");
			Возврат;
		КонецЕсли;
		
		// Отправляем по рабочим дням за Т-2 
		
		ОтчетнаяДата	= Неопределено;
		ТекущийДень		= НачалоДня(ТекущаяДатаСеанса());
		
		Если Справочники.Календари.ЭтоРабочийДень(Справочники.Календари.Общероссийский, ТекущийДень) Тогда
			ОтчетнаяДата = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ТекущийДень - 1, -2);		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОтчетнаяДата) Тогда
			
			ЭтотОбъект.Период = ОтчетнаяДата;
			
			Если Не ЭтотОбъект.ПроверитьЗаполнение() Тогда 
				ЗарегистрироватьОшибки("Не заполнены обязательные параметры.", ОбщегоНазначения.ПолучитьТекстСообщенийПользователю(Символы.ПС, Истина));
				Возврат;
			КонецЕсли;
			
			СформироватьИОтправитьОтчет(ПараметрыКоманды.Получатели, ПараметрыКоманды.ПолучателиОшибок);
			
		КонецЕсли;
		
		#КонецОбласти
			
	Иначе
		
		ВызватьИсключение СтрШаблон("Неизвестный идентификатор команды: ""%1""", ИдентификаторКоманды);	
		
	КонецЕсли;
		
КонецПроцедуры

Процедура СформироватьИОтправитьОтчет(Получатели, ПолучателиОшибок)
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("РегистрироватьВЖурналеОшибокТолькоСистемныеОшибки");
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ОтключитьУведомленияОбОшибкахРасчетаЦены");	
	
	// Формируем отчет
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	ЭтотОбъект.СкомпоноватьРезультат(ДокументРезультат);
	
	// Формируем письмо
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому",		Получатели);
	ПараметрыПисьма.Вставить("Тема",		"Стоимость активов группы Будущего без учета письма ЦБ РФ № ИН-018-53/16");
	ПараметрыПисьма.Вставить("Тело",		"Во вложении отчет за " + Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy"));
	ПараметрыПисьма.Вставить("ТипТекста",	"ПростойТекст");
	ПараметрыПисьма.Вставить("Вложения",	Новый Соответствие);
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗарегистрированныеОшибки") Тогда
		
		// Уведомим об ошибках
		
		ПараметрыПисьма.Кому = ПолучателиОшибок;
		ПараметрыПисьма.Тело =
			СтрШаблон(
				"Ошибка формирования! После устранения проблемы отчет за %1 следует сформировать и отправить вручную.
				|
				|%2",
			Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy"),
			СтрСоединить(ЭтотОбъект.ДополнительныеСвойства.ЗарегистрированныеОшибки, Символы.ПС));
		
	Иначе
		
		// Вложим файл с результатом отчета
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
		
		ДокументРезультат.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX);
		
		ПараметрыПисьма.Вложения.Вставить("Расшифровка стоимости активов.xlsx", ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла)));
		
		УдалитьФайлы(ИмяВременногоФайла);
		
		// Добавим ошибки расчета цены в письмо 
		
		ТекстСообщения = ОписаниеОшибкиРасчетаЦен();
		
		Если Не ПустаяСтрока(ТекстСообщения) Тогда
			
			ПараметрыПисьма.Тело = ПараметрыПисьма.Тело + Символы.ПС + Символы.ПС + ТекстСообщения;		
			
		КонецЕсли;
		
	КонецЕсли;
	
	РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма, , Истина);			
	
КонецПроцедуры

#КонецОбласти

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Ошибки				 = Неопределено;
	
	// Начало сессии статистики
	
	Механизм			= ЭтотОбъект.Метаданные().ПолноеИмя();
	ПараметрыВыполнения	= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект);
	Сессия	 			= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыВыполнения.Хранилище, ПараметрыВыполнения.Описание);
	
	// Получаем данные для отчета
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПоместитьДействующиеСчетаДоверительногоУправленияВМенеджерВременныхТаблиц(Запрос.МенеджерВременныхТаблиц, "_СчетаДоверительногоУправления"); 
	
	#Область Проверяем_готовность_данных
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("ПропуститьПредварительнуюПроверкуГотовностиДанных") Тогда
	
		СчетаДУБезДатЗапрета = Неопределено;
		СчетаДУБезСЧА		 = Неопределено; 
		
		Если Не ПроверитьГотовностьДанных(Запрос.МенеджерВременныхТаблиц, "_СчетаДоверительногоУправления", СчетаДУБезДатЗапрета, СчетаДУБезСЧА) Тогда
			
			ОшибкаЗарегистрирована = Ложь;
			
			Если ЗначениеЗаполнено(СчетаДУБезДатЗапрета) Тогда
				ЗарегистрироватьОшибки(СтрШаблон("На %1 не установлены даты запрета редактирования: %2", Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy"), СтрСоединить(СчетаДУБезДатЗапрета, ", ")), , Ложь);
				ОшибкаЗарегистрирована = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СчетаДУБезСЧА) Тогда
				ЗарегистрироватьОшибки(СтрШаблон("Не зарегистрирована СЧА: %1", СтрСоединить(СчетаДУБезСЧА, ", ")), , Ложь);
				ОшибкаЗарегистрирована = Истина;
			КонецЕсли;
			
			Если Не ОшибкаЗарегистрирована Тогда
				ЗарегистрироватьОшибки("Ошибка проверки готовности данных", , Ложь);
			КонецЕсли;
			
			Возврат;
			
		КонецЕсли;
	
	КонецЕсли;
	
	#КонецОбласти
	
	РассчитываемыеПоПисьмуЦБ0185316 = Новый ТаблицаЗначений;
	РассчитываемыеПоПисьмуЦБ0185316.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
	
	РегистрСтоимостьПереоценкиПоПисьмуЦБ0185316	 = РегистрыСведений.СтоимостьПереоценки.СоздатьНаборЗаписей().Выгрузить();
	РегистрСтоимостьАктивовНеЦБПоПисьмуЦБ0185316 = РегистрыСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СоздатьНаборЗаписей().Выгрузить();
	
	Если ЭтотОбъект.БезУчетаРасчетаПоПисьмуЦБ0185316 Тогда
		
		#Область Получаем_данные_без_расчета_по_письму
		
		Отказ = Ложь;
		
		ЗаполнитьСчетаДоверительногоУправленияРассчитываемыеПоПисьмуЦБ0185316(РассчитываемыеПоПисьмуЦБ0185316, ЭтотОбъект.Период, Запрос, "_СчетаДоверительногоУправления");
		
		Отчет_СведенияОбОценкеВСоответствииСИнформационнымПисьмомЦБРФ = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_СведенияОбОценкеВСоответствииСИнформационнымПисьмомЦБРФ"); 
		Отчет_СведенияОбОценкеВСоответствииСИнформационнымПисьмомЦБРФ.Организация	= ЭтотОбъект.Организация;
		Отчет_СведенияОбОценкеВСоответствииСИнформационнымПисьмомЦБРФ.Период		= ЭтотОбъект.Период;
	
		Для каждого СчетДоверительногоУправления Из РассчитываемыеПоПисьмуЦБ0185316 Цикл
			
			#Область Проверяем_даты_запрета_редактирования
			
			Если Не ПроверитьДатыЗапретаРедактирования(СчетДоверительногоУправления.Ссылка) Тогда
				
				ТекстОшибки = СтрШаблон("На %1 не установлены даты запрета редактирования: %2", Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy"), СчетДоверительногоУправления.Ссылка);
				
				Если СистемныеФункции.ЭтоФоновоеЗадание() Тогда
					ЗарегистрироватьОшибки(ТекстОшибки, , Ложь);
					Возврат;
				Иначе
					ЗарегистрироватьОшибки(ТекстОшибки + ". Активы данного счета д/у не выведены в отчет.", , Ложь);
					Продолжить;
				КонецЕсли;
				
			КонецЕсли;
			
			#КонецОбласти
			
			Отчет_СведенияОбОценкеВСоответствииСИнформационнымПисьмомЦБРФ.СчетДоверительногоУправления = СчетДоверительногоУправления.Ссылка;
			
			СообщенияДоРасчета = ПолучитьСообщенияПользователю(Истина);
			
			Попытка
				
				РСА = Отчет_СведенияОбОценкеВСоответствииСИнформационнымПисьмомЦБРФ.ПолучитьРегистрациюСтоимостиАктивовБезРасчетаПоПисьму(Отказ);
				
				Если Не Отказ Тогда
				
					// ЦБ
					
					РегистрацияСтоимости = РСА.ДополнительныеСвойства.РегистрацияСтоимости;
					
					Для Каждого ТекСтрока Из РегистрацияСтоимости.СтоимостиПереоценки Цикл
						
						Движение = РегистрСтоимостьПереоценкиПоПисьмуЦБ0185316.Добавить();
						
						Движение.Период			= РегистрацияСтоимости.Дата;
						Движение.ВидЦеныОценки	= Перечисления.ВидыЦенОценки.ЦенаОценки;
						
						ЗаполнитьЗначенияСвойств(Движение, РегистрацияСтоимости); 
						ЗаполнитьЗначенияСвойств(Движение, ТекСтрока); 
						
						Если ТекСтрока.ВидЦены = Перечисления.ИсточникиЦеныДляПереоценки.ОшибкаРасчета
							ИЛИ ТекСтрока.Цена = 0 И Не Документы.РегистрацияСтоимостиПереоценки.ДопустимаНулеваяЦена(ТекСтрока)
						Тогда
						    ДобавитьОшибкуРасчетаЦены(ЭтотОбъект.Период, СчетДоверительногоУправления.Ссылка, ТекСтрока.ЦеннаяБумага);
						КонецЕсли;
						
					КонецЦикла;
					
					// Не ЦБ
					
					Для Каждого ТекСтрока Из РСА.АктивыНеОтносящиесяКЦеннымБумагам Цикл
						
						Движение = РегистрСтоимостьАктивовНеЦБПоПисьмуЦБ0185316.Добавить();
						
						Движение.Период = РегистрацияСтоимости.Дата;
						Движение.Валюта = ТекСтрока.ВалютаСтроки;
						
						ЗаполнитьЗначенияСвойств(Движение, РегистрацияСтоимости); 
						ЗаполнитьЗначенияСвойств(Движение, ТекСтрока); 
						
					КонецЦикла;
					
				КонецЕсли;
		
			Исключение
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), , , , Отказ);
				
			КонецПопытки;
			
			ТекстСообщенийПользователю = ОбщегоНазначения.ПолучитьТекстСообщенийПользователю(Символы.ПС, Истина);
			
			ОбщегоНазначения.ВывестиСообщенияПользователю(СообщенияДоРасчета);
			
			Если Отказ Тогда
				ЗарегистрироватьОшибки(СтрШаблон("Ошибка оценки СЧА для '%1' без учета настроек расчета по письму ЦБ РФ № ИН-018-53/16", СчетДоверительногоУправления.Ссылка), ТекстСообщенийПользователю);
				Возврат;
			КонецЕсли;
			
		КонецЦикла; 	
		
		// Уведомляем о накопленных ошибках расчета цены
		
		Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("ОтключитьУведомленияОбОшибкахРасчетаЦены") Тогда
			
			ТекстСообщения = ОписаниеОшибкиРасчетаЦен();
			
			Если Не ПустаяСтрока(ТекстСообщения) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
			
		КонецЕсли;
		
		#КонецОбласти
		
	КонецЕсли;
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(РассчитываемыеПоПисьмуЦБ0185316, "_РассчитываемыеПоПисьмуЦБ0185316", Запрос); 
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(РегистрСтоимостьПереоценкиПоПисьмуЦБ0185316, "_РегистрСтоимостьПереоценкиПоПисьмуЦБ0185316", Запрос); 
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(РегистрСтоимостьАктивовНеЦБПоПисьмуЦБ0185316, "_РегистрСтоимостьАктивовНеЦБПоПисьмуЦБ0185316", Запрос); 
	
	#Область Помещаем_данные_регистров_сведений_СЧА_в_МВТ
	
	Запрос.Текст =	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьПереоценки.*
		|ПОМЕСТИТЬ _РегистрСведенийСтоимостьПереоценки
		|ИЗ
		|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|			ЛЕВОЕ СОЕДИНЕНИЕ _РассчитываемыеПоПисьмуЦБ0185316 КАК _РассчитываемыеПоПисьмуЦБ0185316
		|			ПО (_РассчитываемыеПоПисьмуЦБ0185316.Ссылка = _СчетаДоверительногоУправления.Ссылка)
		|		ПО СтоимостьПереоценки.СчетДоверительногоУправления = _СчетаДоверительногоУправления.Ссылка
		|			И (_РассчитываемыеПоПисьмуЦБ0185316.Ссылка ЕСТЬ NULL)
		|ГДЕ
		|	СтоимостьПереоценки.Организация = &Организация
		|	И СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
		|	И СтоимостьПереоценки.ВидЦеныОценки = ЗНАЧЕНИЕ(Перечисление.ВидыЦенОценки.ЦенаОценки)
		|	И СтоимостьПереоценки.Период = &Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтоимостьПереоценки.*
		|ИЗ
		|	_РегистрСтоимостьПереоценкиПоПисьмуЦБ0185316 КАК СтоимостьПереоценки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтоимостьПереоценки.СчетДоверительногоУправления,
		|	СтоимостьПереоценки.ЦеннаяБумага,
		|	СтоимостьПереоценки.Партия,
		|	СтоимостьПереоценки.СтрокаПартии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.*
		|ПОМЕСТИТЬ _РегистрСведенийСтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|ИЗ
		|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|			ЛЕВОЕ СОЕДИНЕНИЕ _РассчитываемыеПоПисьмуЦБ0185316 КАК _РассчитываемыеПоПисьмуЦБ0185316
		|			ПО (_РассчитываемыеПоПисьмуЦБ0185316.Ссылка = _СчетаДоверительногоУправления.Ссылка)
		|		ПО СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления = _СчетаДоверительногоУправления.Ссылка
		|			И (_РассчитываемыеПоПисьмуЦБ0185316.Ссылка ЕСТЬ NULL)
		|ГДЕ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация
		|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = &Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.*
		|ИЗ
		|	_РегистрСтоимостьАктивовНеЦБПоПисьмуЦБ0185316 КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива,
		|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики";
	
	// Подставляем поля регистров, а не указываем их вручную,
	// чтобы добавление новых реквизитов нормально отрабатывало
	
	Регистры = Новый Структура;
	Регистры.Вставить("СтоимостьПереоценки",						 РегистрСтоимостьПереоценкиПоПисьмуЦБ0185316);
	Регистры.Вставить("СтоимостьАктивовНеОтносящихсяКЦеннымБумагам", РегистрСтоимостьАктивовНеЦБПоПисьмуЦБ0185316);
	
	Для каждого Регистр Из Регистры Цикл
		
		ПоляРегистров = Новый Массив;
		Для каждого Колонка Из Регистр.Значение.Колонки Цикл
			ПоляРегистров.Добавить(Колонка.Имя);	
		КонецЦикла;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, Регистр.Ключ + ".*", Регистр.Ключ + "." + СтрСоединить(ПоляРегистров, "," + Символы.ПС + Символы.Таб + Регистр.Ключ + "."));
		
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("Период",		 ЭтотОбъект.Период);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	
	Запрос.Выполнить();
	
	#КонецОбласти
	
	#Область Получаем_выгружаемые_в_риски_данные
	
	ОшибкаФормированияДанных = Ложь;
	
	ОбработкаЭкспортДанныхДляРисков = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ЭкспортДанныхДляРисков"); 
	
	ОбработкаЭкспортДанныхДляРисков.Организация = ЭтотОбъект.Организация;
	ОбработкаЭкспортДанныхДляРисков.Период		= Новый СтандартныйПериод(ЭтотОбъект.Период, ЭтотОбъект.Период);
	ОбработкаЭкспортДанныхДляРисков.Активы		= Истина;
	
	ОбработкаЭкспортДанныхДляРисков.ДополнительныеСвойства.Вставить("ЗаполнитьДатыПервыхПартий");
	
	ТаблицаДанныхДляВыгрузки = ОбработкаЭкспортДанныхДляРисков.ПолучитьТаблицуДляДанных();
	
	ОбработкаЭкспортДанныхДляРисков.ПолучитьДанныеПоДепозитам(ЭтотОбъект.Период, ТаблицаДанныхДляВыгрузки, Запрос.МенеджерВременныхТаблиц, ОшибкаФормированияДанных);
	ОбработкаЭкспортДанныхДляРисков.ПолучитьОстаткиАктивов(ЭтотОбъект.Период, ТаблицаДанныхДляВыгрузки, Запрос.МенеджерВременныхТаблиц, ОшибкаФормированияДанных);
	
	Если ОшибкаФормированияДанных Тогда
		ЗарегистрироватьОшибки("Не удалось получить данные для отчета", ?(ОбработкаЭкспортДанныхДляРисков.ДополнительныеСвойства.Свойство("Ошибки", Ошибки), Ошибки, Неопределено));		
		Возврат;
	КонецЕсли;
	
	#КонецОбласти
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ТаблицаДанныхДляВыгрузки, "_ТаблицаДанныхДляВыгрузки", Запрос); 	
	
	#Область Получаем_данные_отчета
	
	Запрос.Текст =	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ТаблицаДанныхДляВыгрузки.AssetID КАК AssetID,
		|	КодыМатрихЦенныхБумаг.Объект КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _ЦенныеБумаги
		|ИЗ
		|	_ТаблицаДанныхДляВыгрузки КАК _ТаблицаДанныхДляВыгрузки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&Период,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|					И (ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Облигации)
		|						ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Акции)
		|						ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Векселя)
		|						ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ПроизводныеФинансовыеИнструменты)
		|						ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ДепозитарныеРасписки)
		|						ИЛИ ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Паи))) КАК КодыМатрихЦенныхБумаг
		|		ПО _ТаблицаДанныхДляВыгрузки.AssetID = КодыМатрихЦенныхБумаг.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЦенныеБумаги.AssetID КАК AssetID,
		|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	КодыISIN.Код КАК ISIN,
		|	КраткийКодНаММВБ.Код КАК КраткийКодНаММВБ,
		|	ВЫБОР
		|		КОГДА _ЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|			ТОГДА Акции.ГосударственныйРегистрационныйНомер
		|		КОГДА _ЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА Облигации.ГосударственныйРегистрационныйНомер
		|		КОГДА _ЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|			ТОГДА ИпотечныеСертификатыУчастия.ГосударственныйРегистрационныйНомер
		|	КОНЕЦ КАК ГосударственныйРегистрационныйНомер,
		|	ВЫБОР
		|		КОГДА _ЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|			ТОГДА Акции.Номинал
		|		КОГДА _ЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА НоминалыЦенныхБумаг.Номинал
		|	КОНЕЦ КАК Номинал,
		|	Облигации.Категория КАК КатегорияОблигации,
		|	Облигации.Подкатегория КАК ПодкатегорияОблигации
		|ПОМЕСТИТЬ _ХарактеристикиБумаг
		|ИЗ
		|	_ЦенныеБумаги КАК _ЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Акции КАК Акции
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = Акции.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = Облигации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Векселя КАК Векселя
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = Векселя.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитарныеРасписки КАК ДепозитарныеРасписки
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = ДепозитарныеРасписки.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИпотечныеСертификатыУчастия КАК ИпотечныеСертификатыУчастия
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = ИпотечныеСертификатыУчастия.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних(
		|				&Период,
		|				ЦеннаяБумага В
		|					(ВЫБРАТЬ
		|						_ЦенныеБумаги.ЦеннаяБумага
		|					ИЗ
		|						_ЦенныеБумаги)) КАК НоминалыЦенныхБумаг
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(
		|				&Период,
		|				(Объект, ВидКода) В
		|					(ВЫБРАТЬ
		|						_ЦенныеБумаги.ЦеннаяБумага,
		|						ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)
		|					ИЗ
		|						_ЦенныеБумаги)) КАК КодыISIN
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = КодыISIN.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(
		|				&Период,
		|				(Объект, ВидКода) В
		|					(ВЫБРАТЬ
		|						_ЦенныеБумаги.ЦеннаяБумага,
		|						ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБКраткий)
		|					ИЗ
		|						_ЦенныеБумаги)) КАК КраткийКодНаММВБ
		|		ПО _ЦенныеБумаги.ЦеннаяБумага = КраткийКодНаММВБ.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ХарактеристикиБумаг.ISIN КАК ISIN
		|ИЗ
		|	_ХарактеристикиБумаг КАК _ХарактеристикиБумаг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ТаблицаДанныхДляВыгрузки КАК _ТаблицаДанныхДляВыгрузки
		|		ПО (_ТаблицаДанныхДляВыгрузки.AssetID = _ХарактеристикиБумаг.AssetID)
		|			И (_ТаблицаДанныхДляВыгрузки.AssetType = ""Bonds"")
		|ГДЕ
		|	_ХарактеристикиБумаг.ISIN ЕСТЬ НЕ NULL 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(_ТаблицаДанныхДляВыгрузки.AssetDate, ДЕНЬ) КАК Дата,
		|	ВЫБОР
		|		КОГДА _ТаблицаДанныхДляВыгрузки.ClientCode В (""DU_RT_PN084"", ""DU_RT_PN091"", ""DU_RT_PN092"", ""DU_RT_PN093"", ""DU_RT_PR081"", ""DU_RT_PR104"", ""DU_RT_NPF153"", ""DU_RT_PR103"", ""DU_RT_PR105"", ""DU_RT_PN083"", ""DU_RT_PN085"", ""DU_RT_PN089"", ""DU_RT_PN090"", ""DU_RT_PR079"", ""DU_RT_NPF152"", ""DU_RT_PN064"", ""DU_RT_PN065"", ""DU_RT_PN066"", ""DU_RT_PN067"", ""DU_RT_PR053"", ""DU_RT_PR068"", ""DU_RT_PR078"", ""DU_RT_PR080"", ""DU_RT_PR121"", ""DU_RT_PR122"", ""DU_RT_NPF100"", ""DU_RT_PN060"", ""DU_RT_PN061"", ""DU_RT_PN062"", ""DU_RT_PN063"", ""DU_RT_PN077"", ""DU_RT_PN082"", ""DU_RT_PN086"", ""DU_RT_PN087"", ""DU_RT_PN088"", ""DU_RT_PN094"", ""DU_RT_PN095"", ""DU_RT_PN096"", ""DU_RT_PN123"", ""DU_RT_PN124"", ""DU_RT_PN125"", ""DU_RT_PN126"", ""DU_NPF1269"", ""DU_NPF1315"", ""DU_NPF1330"", ""DU_NPF1417"", ""DU_NPF1418"", ""DU_NPF382"", ""DU_NPF398"", ""DU_NPF399"", ""DU_NPF411"", ""DU_NPF412"", ""DU_NPF470"", ""DU_NPF651"", ""DU_NPF652"", ""DU_RT_PR059"", ""DU_RT_PR072"", ""DU_UL381"", ""DU_RT_PN129"", ""DU_NPF376"", ""DU_RT_PN132"", ""DU_RT_PN130"", ""DU_NPF378"", ""DU_RT_PN131"", ""DU_NPF377"", ""DU_NPF383"", ""DU_RT_PR133"", ""DU_RT_NPF151"", ""DU_RT_NPF141"", ""DU_RT_PN135"", ""DU_RT_PN136"", ""DU_RT_PN137"", ""DU_RT_PN138"", ""DU_RT_PR139"", ""DU_RT_PR140"", ""DU_RT_PR160"", ""DU_RT_PN143"", ""DU_RT_PN144"", ""DU_RT_PN145"", ""DU_RT_PN146"", ""DU_RT_PR147"", ""DU_RT_NPF154"", ""DU_RT_PN155"", ""DU_RT_PN156"", ""DU_RT_PN157"", ""DU_RT_PN158"", ""DU_RT_PR159"")
		|			ТОГДА ""Рыночный""
		|		КОГДА _ТаблицаДанныхДляВыгрузки.ClientCode В (""DU_RT_NPF097"", ""DU_RT_NPF098"", ""DU_RT_NPF099"", ""DU_RT_PN110"", ""DU_RT_PN112"", ""DU_RT_PN113"", ""DU_RT_PN118"", ""DU_RT_PN119"", ""DU_RT_PR109"", ""DU_RT_PR111"", ""DU_RT_PR114"", ""DU_RT_PR115"", ""DU_RT_PR116"", ""DU_RT_PR117"", ""DU_RT_PN149"", ""DU_RT_PR148"", ""DU_RT_PN150"")
		|			ТОГДА ""Прочее""
		|		ИНАЧЕ ""Без признака""
		|	КОНЕЦ КАК ПризнакПортфеля,
		|	ВЫБОР
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
		|			ТОГДА ""ПН""
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
		|			ТОГДА ""ПР""
		|		КОГДА СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов)
		|			ТОГДА ""СС""
		|	КОНЕЦ КАК ВидИмущества,
		|	_ТаблицаДанныхДляВыгрузки.ClientName КАК НаименованиеПортфеля,
		|	ЕСТЬNULL(РеквизитыЮрЛицКлиентов.КраткоеНаименованиеПоУставу, РеквизитыФизЛицКлиентов.Фамилия + "" "" + РеквизитыФизЛицКлиентов.Имя + "" "" + РеквизитыФизЛицКлиентов.Отчество) КАК НаименованиеФонда,
		|	ВЫБОР
		|		КОГДА _ТаблицаДанныхДляВыгрузки.AssetType = ""Stocks""
		|			ТОГДА ""Акции""
		|		КОГДА _ТаблицаДанныхДляВыгрузки.AssetType = ""Default""
		|				И _ХарактеристикиБумаг.ISIN В (""RU000A0JVUB7"", ""RU000A0JXSR3"", ""RU000A0JUHV4"")
		|			ТОГДА ""Облигации корпоративные""
		|		КОГДА _ТаблицаДанныхДляВыгрузки.AssetType = ""Default""
		|				И _ХарактеристикиБумаг.ISIN В (""RU000A0JURM2"", ""RU000A0JUWV3"")
		|				И _ТаблицаДанныхДляВыгрузки.ClientCode В (""DU_RT_PR139"", ""DU_RT_PN135"")
		|			ТОГДА ""Облигации корпоративные""
		|		КОГДА _ТаблицаДанныхДляВыгрузки.AssetType = ""Bonds""
		|			ТОГДА ВЫБОР
		|					КОГДА _ХарактеристикиБумаг.ПодкатегорияОблигации В (ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхОблигаций.ОВОЗ), ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхОблигаций.ОВОЗРФ))
		|						ТОГДА ""ОВОЗ""
		|					КОГДА _ХарактеристикиБумаг.КатегорияОблигации = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная)
		|						ТОГДА ""ГЦБ РФ""
		|					КОГДА _ХарактеристикиБумаг.КатегорияОблигации В (ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная), ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Еврооблигация), ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Ипотечная))
		|						ТОГДА ""Облигации корпоративные""
		|					КОГДА _ХарактеристикиБумаг.КатегорияОблигации = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Муниципальная)
		|						ТОГДА ""Облигации муниципальные""
		|					КОГДА _ХарактеристикиБумаг.КатегорияОблигации = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Субфедеральная)
		|						ТОГДА ""Облигации субъектов РФ""
		|				КОНЕЦ
		|		КОГДА _ТаблицаДанныхДляВыгрузки.AssetType = ""Money_R""
		|			ТОГДА ""Денежные средства на расчетных счетах""
		|		КОГДА _ТаблицаДанныхДляВыгрузки.AssetType = ""MBP""
		|			ТОГДА ""Денежные средства на расчетных счетах""
		|		КОГДА _ТаблицаДанныхДляВыгрузки.AssetType = ""Money_B""
		|			ТОГДА ""Денежные средства на брокерских счетах""
		|		КОГДА _ТаблицаДанныхДляВыгрузки.AssetType = ""Deposits""
		|			ТОГДА ""Депозиты""
		|		КОГДА _ТаблицаДанныхДляВыгрузки.AssetType = ""MPC""
		|			ТОГДА ""ИСУ""
		|		КОГДА _ТаблицаДанныхДляВыгрузки.AssetType = ""DebitRPO""
		|			ТОГДА ""Дебиторская задолженность по РЕПО""
		|		КОГДА _ТаблицаДанныхДляВыгрузки.AssetType = ""CreditRPO""
		|			ТОГДА ""Кредиторская задолженность по РЕПО""
		|		КОГДА _ТаблицаДанныхДляВыгрузки.AssetType ПОДОБНО ""Credit%""
		|			ТОГДА ""Кредиторская задолженность""
		|		КОГДА _ТаблицаДанныхДляВыгрузки.AssetType ПОДОБНО ""Debit%""
		|			ТОГДА ""Прочая дебиторская задолженность""
		|		КОГДА _ТаблицаДанныхДляВыгрузки.AssetType = ""DepositsREZ""
		|			ТОГДА ""Депозиты Резервы""
		|		КОГДА _ТаблицаДанныхДляВыгрузки.AssetType = ""Futures""
		|			ТОГДА ""Фьючерсные контракты""
		|		ИНАЧЕ ""Прочие активы""
		|	КОНЕЦ КАК ТипАктива,
		|	ЮрФизЛицаЭмитентов.Наименование КАК Эмитент,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ТаблицаДанныхДляВыгрузки.RegistrationCode) = ТИП(СТРОКА)
		|				И _ТаблицаДанныхДляВыгрузки.RegistrationCode <> """"
		|			ТОГДА _ТаблицаДанныхДляВыгрузки.RegistrationCode
		|		КОГДА _ХарактеристикиБумаг.ГосударственныйРегистрационныйНомер ПОДОБНО ""%не предусмотрен%""
		|			ТОГДА _ХарактеристикиБумаг.ISIN
		|		ИНАЧЕ _ХарактеристикиБумаг.ГосударственныйРегистрационныйНомер
		|	КОНЕЦ КАК РегНомер,
		|	ЕСТЬNULL(_ХарактеристикиБумаг.Номинал, _ТаблицаДанныхДляВыгрузки.FaceValue) КАК Номинал,
		|	_ТаблицаДанныхДляВыгрузки.Quantity - _ТаблицаДанныхДляВыгрузки.REPOQuantity КАК КоличествоБезУчетаРЕПО,
		|	_ТаблицаДанныхДляВыгрузки.CurrencyCode КАК Валюта,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА _ТаблицаДанныхДляВыгрузки.IssuerID В (220059, 219232, 235158)
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА _ТаблицаДанныхДляВыгрузки.Quantity = 0
		|						ТОГДА _ТаблицаДанныхДляВыгрузки.EvaluationPriceCurrency
		|					КОГДА _ТаблицаДанныхДляВыгрузки.AssetType В (""Deposits"", ""MBP"")
		|						ТОГДА _ТаблицаДанныхДляВыгрузки.FaceValue + _ТаблицаДанныхДляВыгрузки.AccintBack
		|					ИНАЧЕ _ТаблицаДанныхДляВыгрузки.AccintBack + (_ТаблицаДанныхДляВыгрузки.Quantity - _ТаблицаДанныхДляВыгрузки.REPOQuantity) * _ТаблицаДанныхДляВыгрузки.EvaluationPriceCurrency
		|				КОНЕЦ * _ТаблицаДанныхДляВыгрузки.CurrRate
		|		КОНЕЦ КАК ЧИСЛО(27, 2)) КАК Сумма,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА _ТаблицаДанныхДляВыгрузки.IssuerID В (220059, 219232, 235158)
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА _ТаблицаДанныхДляВыгрузки.Quantity = 0
		|						ТОГДА _ТаблицаДанныхДляВыгрузки.EvaluationPriceCurrency
		|					КОГДА _ТаблицаДанныхДляВыгрузки.AssetType В (""Deposits"", ""MBP"")
		|						ТОГДА _ТаблицаДанныхДляВыгрузки.FaceValue
		|					ИНАЧЕ (_ТаблицаДанныхДляВыгрузки.Quantity - _ТаблицаДанныхДляВыгрузки.REPOQuantity) * _ТаблицаДанныхДляВыгрузки.EvaluationPriceCurrency
		|				КОНЕЦ * _ТаблицаДанныхДляВыгрузки.CurrRate
		|		КОНЕЦ КАК ЧИСЛО(27, 2)) КАК СуммаБезНКД,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА _ТаблицаДанныхДляВыгрузки.Quantity <> _ТаблицаДанныхДляВыгрузки.REPOQuantity
		|				ТОГДА _ТаблицаДанныхДляВыгрузки.AccintBack / (_ТаблицаДанныхДляВыгрузки.Quantity - _ТаблицаДанныхДляВыгрузки.REPOQuantity) * _ТаблицаДанныхДляВыгрузки.CurrRate
		|		КОНЕЦ КАК ЧИСЛО(27, 2)) КАК НКД,
		|	_ХарактеристикиБумаг.ISIN КАК ISIN,
		|	ВЫБОР
		|		КОГДА РеквизитыЭмитента.ИНН = """"
		|			ТОГДА РеквизитыЭмитента.ОГРН
		|		ИНАЧЕ РеквизитыЭмитента.ИНН
		|	КОНЕЦ КАК ИНН_TIN,
		|	_ХарактеристикиБумаг.КраткийКодНаММВБ КАК КодБиржи,
		|	NULL КАК КраткоеНаименование,
		|	NULL КАК ПолноеНаименование,
		|	ВЫБОР
		|		КОГДА _ТаблицаДанныхДляВыгрузки.AssetType = ""Deposits""
		|			ТОГДА _ТаблицаДанныхДляВыгрузки.DTM
		|	КОНЕЦ КАК ДатаПогашенияДепозита,
		|	ВЫБОР
		|		КОГДА _ТаблицаДанныхДляВыгрузки.AssetType В (""Deposits"", ""DebitRPO"")
		|			ТОГДА _ТаблицаДанныхДляВыгрузки.YTM
		|	КОНЕЦ КАК ТекущаяПроцентаяСтавкаПоДепозиту,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА _ТаблицаДанныхДляВыгрузки.AssetType В (""Deposits"", ""DebitRPO"")
		|				ТОГДА ""Фиксированная""
		|			ИНАЧЕ NULL
		|		КОНЕЦ, ""NULL"") КАК ВидПроцентнойСтавкиПоДепозиту,
		|	NULL КАК ЛучшийРейтинг,
		|	ВЫБОР
		|		КОГДА _ТаблицаДанныхДляВыгрузки.AssetType В (""Bonds"", ""Stocks"")
		|				И _ТаблицаДанныхДляВыгрузки.Quantity <> _ТаблицаДанныхДляВыгрузки.REPOQuantity
		|			ТОГДА ВЫБОР
		|					КОГДА _ТаблицаДанныхДляВыгрузки.class = 1
		|						ТОГДА ""по справедливой""
		|					КОГДА _ТаблицаДанныхДляВыгрузки.class = 2
		|						ТОГДА ""в наличии для продажи""
		|					КОГДА _ТаблицаДанныхДляВыгрузки.class = 3
		|						ТОГДА ""до погашения""
		|					КОГДА _ТаблицаДанныхДляВыгрузки.class = 4
		|						ТОГДА ""по амортизированной""
		|					ИНАЧЕ _ТаблицаДанныхДляВыгрузки.class
		|				КОНЕЦ
		|		ИНАЧЕ ""не применимо""
		|	КОНЕЦ КАК МетодУчета,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	_ТаблицаДанныхДляВыгрузки.AssetType КАК AssetType,
		|	_ТаблицаДанныхДляВыгрузки.Quantity КАК Quantity
		|ПОМЕСТИТЬ _ДанныеОтчета
		|ИЗ
		|	_ТаблицаДанныхДляВыгрузки КАК _ТаблицаДанныхДляВыгрузки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|			ПО СчетаДоверительногоУправления.Ссылка = _СчетаДоверительногоУправления.Ссылка
		|		ПО (СчетаДоверительногоУправления.КодСчета = _ТаблицаДанныхДляВыгрузки.ClientCode)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				(Организация, ЮрФизЛицо, Язык) В
		|					(ВЫБРАТЬ
		|						&Организация,
		|						_СчетаДоверительногоУправления.Клиент,
		|						ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК РеквизитыЮрЛицКлиентов
		|		ПО (РеквизитыЮрЛицКлиентов.ЮрФизЛицо = _СчетаДоверительногоУправления.Клиент)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				(Организация, ЮрФизЛицо, Язык) В
		|					(ВЫБРАТЬ
		|						&Организация,
		|						_СчетаДоверительногоУправления.Клиент,
		|						ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					ИЗ
		|						_СчетаДоверительногоУправления)) КАК РеквизитыФизЛицКлиентов
		|		ПО (РеквизитыФизЛицКлиентов.ЮрФизЛицо = _СчетаДоверительногоУправления.Клиент)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ХарактеристикиБумаг КАК _ХарактеристикиБумаг
		|		ПО _ТаблицаДанныхДляВыгрузки.AssetID = _ХарактеристикиБумаг.AssetID
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&Период,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица)) КАК КодыМатрихЭмитентов
		|		ПО _ТаблицаДанныхДляВыгрузки.IssuerID = КодыМатрихЭмитентов.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК ЮрФизЛицаЭмитентов
		|		ПО (КодыМатрихЭмитентов.Объект = ЮрФизЛицаЭмитентов.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЭмитента
		|		ПО (РеквизитыЭмитента.ЮрФизЛицо = ЮрФизЛицаЭмитентов.Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеОтчета.Дата КАК Дата,
		|	ЕСТЬNULL(_ДанныеОтчета.ПризнакПортфеля, ""NULL"") КАК ПризнакПортфеля,
		|	ЕСТЬNULL(_ДанныеОтчета.ВидИмущества, ""NULL"") КАК ВидИмущества,
		|	ЕСТЬNULL(_ДанныеОтчета.НаименованиеПортфеля, ""NULL"") КАК НаименованиеПортфеля,
		|	ЕСТЬNULL(_ДанныеОтчета.НаименованиеФонда, ""NULL"") КАК НаименованиеФонда,
		|	ЕСТЬNULL(_ДанныеОтчета.ТипАктива, ""NULL"") КАК ТипАктива,
		|	ЕСТЬNULL(_ДанныеОтчета.Эмитент, ""NULL"") КАК Эмитент,
		|	ЕСТЬNULL(_ДанныеОтчета.РегНомер, ""NULL"") КАК РегНомер,
		|	ЕСТЬNULL(_ДанныеОтчета.Номинал, 0) КАК Номинал,
		|	ЕСТЬNULL(_ДанныеОтчета.КоличествоБезУчетаРЕПО, 0) КАК КоличествоБезУчетаРЕПО,
		|	ЕСТЬNULL(_ДанныеОтчета.Валюта, ""NULL"") КАК Валюта,
		|	ЕСТЬNULL(_ДанныеОтчета.Сумма, 0) КАК Сумма,
		|	ЕСТЬNULL(_ДанныеОтчета.СуммаБезНКД, 0) КАК СуммаБезНКД,
		|	ЕСТЬNULL(_ДанныеОтчета.НКД, 0) КАК НКД,
		|	ЕСТЬNULL(_ДанныеОтчета.ISIN, ""NULL"") КАК ISIN,
		|	ЕСТЬNULL(_ДанныеОтчета.ИНН_TIN, ""NULL"") КАК ИНН_TIN,
		|	ЕСТЬNULL(_ДанныеОтчета.КодБиржи, ""NULL"") КАК КодБиржи,
		|	ЕСТЬNULL(_ДанныеОтчета.КраткоеНаименование, ""NULL"") КАК КраткоеНаименование,
		|	ЕСТЬNULL(_ДанныеОтчета.ПолноеНаименование, ""NULL"") КАК ПолноеНаименование,
		|	ЕСТЬNULL(_ДанныеОтчета.ДатаПогашенияДепозита, 0) КАК ДатаПогашенияДепозита,
		|	ЕСТЬNULL(_ДанныеОтчета.ТекущаяПроцентаяСтавкаПоДепозиту, 0) КАК ТекущаяПроцентаяСтавкаПоДепозиту,
		|	ЕСТЬNULL(_ДанныеОтчета.ВидПроцентнойСтавкиПоДепозиту, ""NULL"") КАК ВидПроцентнойСтавкиПоДепозиту,
		|	ЕСТЬNULL(_ДанныеОтчета.ЛучшийРейтинг, ""NULL"") КАК ЛучшийРейтинг,
		|	ЕСТЬNULL(_ДанныеОтчета.МетодУчета, ""NULL"") КАК МетодУчета,
		|	ЕСТЬNULL(_ДанныеОтчета.НомерДоговора, ""NULL"") КАК НомерДоговора,
		|	_ДанныеОтчета.AssetType КАК AssetType,
		|	_ДанныеОтчета.Quantity КАК Quantity
		|ИЗ
		|	_ДанныеОтчета КАК _ДанныеОтчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	_ДанныеОтчета.ВидИмущества,
		|	_ДанныеОтчета.НомерДоговора,
		|	_ДанныеОтчета.AssetType,
		|	_ДанныеОтчета.Эмитент,
		|	_ДанныеОтчета.Quantity";
	
	#КонецОбласти	
	
	ДанныеОтчета = Запрос.Выполнить().Выбрать();
	
	Если ДанныеОтчета.Количество() <> ТаблицаДанныхДляВыгрузки.Количество() Тогда
		ЗарегистрироватьОшибки("Дублирование строк в отчете!");
		Возврат;
	КонецЕсли;
	
	// Выводим результат в табличный документ

	Макет = ПолучитьМакет("Макет");
	
	ОбластьШапка	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	Пока ДанныеОтчета.Следующий() Цикл
		
		ОбластьСтрока.Параметры.Заполнить(ДанныеОтчета);
		
		ДокументРезультат.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	// Параметры печати и пр.
	
	ДокументРезультат.ФиксацияСверху = ОбластьШапка.ВысотаТаблицы;
	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, Механизм, Ложь, ОриентацияСтраницы.Ландшафт);
	
	// Фиксация сессии статистики
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия); 
	
КонецПроцедуры

#Область Служебные_процедуры_и_функции

Процедура ПоместитьДействующиеСчетаДоверительногоУправленияВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц, ИмяВременнойТаблицы)
	
	ОтборСчетовДоверительногоУправления = Новый Структура("Организация, Клиент",
		ЭтотОбъект.Организация, ?(ЗначениеЗаполнено(ЭтотОбъект.Клиенты), ЭтотОбъект.Клиенты, Неопределено));
		
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ИсключаемыеСчетаДоверительногоУправления")
		И ЗначениеЗаполнено(ЭтотОбъект.ДополнительныеСвойства.ИсключаемыеСчетаДоверительногоУправления)
	Тогда
	
		ИмяВременнойТаблицыБезИсключений = ИмяВременнойТаблицы + "БезИсключений"; 
	
		Справочники.СчетаДоверительногоУправления.ПоместитьДействующиеСчетаДоверительногоУправленияВМенеджерВременныхТаблиц(
			МенеджерВременныхТаблиц, ЭтотОбъект.Период, ОтборСчетовДоверительногоУправления, ИмяВременнойТаблицыБезИсключений);
			
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	*
			|ПОМЕСТИТЬ #СчетаДоверительногоУправления#
			|ИЗ
			|	#СчетаДоверительногоУправленияБезИсключений# КАК СчетаДоверительногоУправления
			|ГДЕ
			|	НЕ СчетаДоверительногоУправления.Ссылка В (&ИсключаемыеСчета)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ #СчетаДоверительногоУправленияБезИсключений#";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#СчетаДоверительногоУправления#",				 ИмяВременнойТаблицы);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#СчетаДоверительногоУправленияБезИсключений#", ИмяВременнойТаблицыБезИсключений);
		
		Запрос.УстановитьПараметр("ИсключаемыеСчета", ЭтотОбъект.ДополнительныеСвойства.ИсключаемыеСчетаДоверительногоУправления);
		
		Запрос.Выполнить();
		
	Иначе
	
		Справочники.СчетаДоверительногоУправления.ПоместитьДействующиеСчетаДоверительногоУправленияВМенеджерВременныхТаблиц(
			МенеджерВременныхТаблиц, ЭтотОбъект.Период, ОтборСчетовДоверительногоУправления, ИмяВременнойТаблицы);
		
	КонецЕсли;
			
КонецПроцедуры

Функция ПроверитьГотовностьДанных(МенеджерВременныхТаблиц = Неопределено, ИмяВременнойТаблицыСчетовДУ = "_СчетаДоверительногоУправления", СчетаДоверительногоУправленияБезДатЗапрета = Неопределено, СчетаДоверительногоУправленияБезСЧА = Неопределено) Экспорт

	ПроверкаПройдена = Истина;	
	
	Если МенеджерВременныхТаблиц = Неопределено Тогда
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти(ИмяВременнойТаблицыСчетовДУ) = Неопределено Тогда
		ПоместитьДействующиеСчетаДоверительногоУправленияВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц, ИмяВременнойТаблицыСчетовДУ)	
	КонецЕсли;
	
	Если Не ПроверитьДатыЗапретаРедактирования(ИмяВременнойТаблицыСчетовДУ, МенеджерВременныхТаблиц, СчетаДоверительногоУправленияБезДатЗапрета) Тогда
		ПроверкаПройдена = Ложь;
	КонецЕсли;
	
	Если Не ПроверитьРегистрациюСЧА(ИмяВременнойТаблицыСчетовДУ, МенеджерВременныхТаблиц, СчетаДоверительногоУправленияБезСЧА) Тогда
		ПроверкаПройдена = Ложь;
	КонецЕсли;
	
	Возврат ПроверкаПройдена;
	
КонецФункции

Функция ПроверитьДатыЗапретаРедактирования(СчетаДоверительногоУправления = Неопределено, ИсточникВременныхТаблиц = Неопределено, СчетаДоверительногоУправленияБезДатЗапрета = Неопределено)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК Ссылка
		|ИЗ
		|	#СчетаДоверительногоУправления# КАК СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактирования
		|		ПО (ДатыЗапретаРедактирования.Организация = &Организация)
		|			И (ДатыЗапретаРедактирования.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка)
		|			И (ДатыЗапретаРедактирования.ГруппаЗапрета = &ГруппаЗапрета)
		|			И (ДатыЗапретаРедактирования.ВидУчета = &ВидУчета)
		|			И (ДатыЗапретаРедактирования.ДатаЗапретаРедактирования <> ДАТАВРЕМЯ(1, 1, 1))
		|			И (КОНЕЦПЕРИОДА(ДатыЗапретаРедактирования.ДатаЗапретаРедактирования, ДЕНЬ) < КОНЕЦПЕРИОДА(&Период, ДЕНЬ))");	
	
	Если ТипЗнч(СчетаДоверительногоУправления) = Тип("Строка") Тогда
		
		Запрос.МенеджерВременныхТаблиц = ?(ТипЗнч(ИсточникВременныхТаблиц) = Тип("МенеджерВременныхТаблиц"), ИсточникВременныхТаблиц, ИсточникВременныхТаблиц.МенеджерВременныхТаблиц);
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#СчетаДоверительногоУправления#", СчетаДоверительногоУправления);
		
	Иначе
		
		Запрос.УстановитьПараметр("СчетаДоверительногоУправления", СчетаДоверительногоУправления);
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#СчетаДоверительногоУправления#", "(ВЫБРАТЬ Ссылка ИЗ Справочник.СчетаДоверительногоУправления ГДЕ Ссылка В (&СчетаДоверительногоУправления))");
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период",			ЭтотОбъект.Период);
	Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ГруппаЗапрета",	Перечисления.ГруппыЗапретаРедактирования.БэкОфис);
	Запрос.УстановитьПараметр("ВидУчета",		Перечисления.ВидыУчета.ПустаяСсылка());
	
	СчетаДоверительногоУправленияБезДатЗапрета = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
	Возврат (СчетаДоверительногоУправленияБезДатЗапрета.Количество() = 0);
	
КонецФункции

Функция ПроверитьРегистрациюСЧА(СчетаДоверительногоУправления = Неопределено, ИсточникВременныхТаблиц = Неопределено, СчетаДоверительногоУправленияБезСЧА = Неопределено)
	
	// Оставим только тех, у кого есть остатки денег и/или бумаг
	// #Техдолг т.к. такой же фильтр есть в обработке ПроведениеРегламентныхОпераций
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _СчетаБезСЧА
		|ИЗ
		|	#СчетаДоверительногоУправления# КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК РегистрацииСЧА
		|		ПО (РегистрацииСЧА.Организация = &Организация)
		|			И (РегистрацииСЧА.СубъектАналитики = СчетаДоверительногоУправления.Ссылка)
		|			И (РегистрацииСЧА.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|			И (ТИПЗНАЧЕНИЯ(РегистрацииСЧА.Регистратор) = ТИП(Документ.РегистрацияСтоимостиАктивов))
		|			И (РегистрацииСЧА.Период = &Период)
		|ГДЕ
		|	РегистрацииСЧА.Значение ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_СчетаБезСЧА.Ссылка КАК Ссылка
		|ИЗ
		|	_СчетаБезСЧА КАК _СчетаБезСЧА
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|		ПО (ОстаткиДенежныхСредств.СчетДоверительногоУправления = _СчетаБезСЧА.Ссылка)
		|			И (ОстаткиДенежныхСредств.Организация = &Организация)
		|			И (ОстаткиДенежныхСредств.Период <= КОНЕЦПЕРИОДА(&Период, ДЕНЬ))
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_СчетаБезСЧА.Ссылка
		|ИЗ
		|	_СчетаБезСЧА КАК _СчетаБезСЧА
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиЦенныхБумаг КАК ОстаткиЦенныхБумаг
		|		ПО (ОстаткиЦенныхБумаг.СчетДоверительногоУправления = _СчетаБезСЧА.Ссылка)
		|			И (ОстаткиЦенныхБумаг.Организация = &Организация)
		|			И (ОстаткиЦенныхБумаг.Период <= КОНЕЦПЕРИОДА(&Период, ДЕНЬ))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _СчетаБезСЧА");	
	
	Если ТипЗнч(СчетаДоверительногоУправления) = Тип("Строка") Тогда
		
		Запрос.МенеджерВременныхТаблиц = ?(ТипЗнч(ИсточникВременныхТаблиц) = Тип("МенеджерВременныхТаблиц"), ИсточникВременныхТаблиц, ИсточникВременныхТаблиц.МенеджерВременныхТаблиц);
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#СчетаДоверительногоУправления#", СчетаДоверительногоУправления);
		
	Иначе
		
		Запрос.УстановитьПараметр("СчетаДоверительногоУправления", СчетаДоверительногоУправления);
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#СчетаДоверительногоУправления#", "(ВЫБРАТЬ Ссылка ИЗ Справочник.СчетаДоверительногоУправления ГДЕ Ссылка В (&СчетаДоверительногоУправления))");
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период",			ЭтотОбъект.Период);
	Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ГруппаЗапрета",	Перечисления.ГруппыЗапретаРедактирования.БэкОфис);
	Запрос.УстановитьПараметр("ВидУчета",		Перечисления.ВидыУчета.ПустаяСсылка());
	
	СчетаДоверительногоУправленияБезСЧА = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
	Возврат (СчетаДоверительногоУправленияБезСЧА.Количество() = 0);
	
КонецФункции

Процедура ЗаполнитьСчетаДоверительногоУправленияРассчитываемыеПоПисьмуЦБ0185316(РассчитываемыеПоПисьмуЦБ0185316, Период, ИсточникВременныхТаблиц, ИмяВременнойТаблицыСчетовДоверительногоУправления)
	
	МенеджерВременныхТаблиц = ?(ТипЗнч(ИсточникВременныхТаблиц) = Тип("МенеджерВременныхТаблиц"), ИсточникВременныхТаблиц, ИсточникВременныхТаблиц.МенеджерВременныхТаблиц);	
	
	СчетаДоверительногоУправления = МенеджерВременныхТаблиц.Таблицы[ИмяВременнойТаблицыСчетовДоверительногоУправления].ПолучитьДанные().Выбрать();	
	
	Пока СчетаДоверительногоУправления.Следующий() Цикл
		
		НастройкиОценки = РаботаСПереоценкой.ОпределитьНастройкиОценки(
			Период, ЭтотОбъект.Организация, СчетаДоверительногоУправления.Ссылка, Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении);
		
		Если НастройкиОценки.ВыполнятьРасчетПоПисьмуЦБ0185316 Тогда
			ЗаполнитьЗначенияСвойств(РассчитываемыеПоПисьмуЦБ0185316.Добавить(), СчетаДоверительногоУправления); 	
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьОшибкуРасчетаЦены(Дата, СчетДоверительногоУправления, ЦеннаяБумага)
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("ОшибкиРасчетаЦены") Тогда
		
		ИзмеренияСтоимостиПереоценки = Метаданные.РегистрыСведений.СтоимостьПереоценки.Измерения;
		
		ОшибкиРасчетаЦены = Новый ТаблицаЗначений;
		ОшибкиРасчетаЦены.Колонки.Добавить("Дата",						Новый ОписаниеТипов("Дата"));
		ОшибкиРасчетаЦены.Колонки.Добавить("СчетДоверительногоУправления",	ИзмеренияСтоимостиПереоценки.СчетДоверительногоУправления.Тип);
		ОшибкиРасчетаЦены.Колонки.Добавить("ЦеннаяБумага",					ИзмеренияСтоимостиПереоценки.ЦеннаяБумага.Тип);
		
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ОшибкиРасчетаЦены", ОшибкиРасчетаЦены);
		
	КонецЕсли;
	
	ОшибкаРасчетаЦены = ЭтотОбъект.ДополнительныеСвойства.ОшибкиРасчетаЦены.Добавить();
	ОшибкаРасчетаЦены.Дата							= Дата;
	ОшибкаРасчетаЦены.СчетДоверительногоУправления	= СчетДоверительногоУправления;
	ОшибкаРасчетаЦены.ЦеннаяБумага					= ЦеннаяБумага;
	
КонецПроцедуры

Функция ОписаниеОшибкиРасчетаЦен()
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("ОшибкиРасчетаЦены") Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ЭтотОбъект.ДополнительныеСвойства.ОшибкиРасчетаЦены, "_ОшибкиРасчетаЦены", Запрос, Истина);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОшибкиРасчетаЦены.Дата КАК Дата,
		|	ПРЕДСТАВЛЕНИЕ(_ОшибкиРасчетаЦены.СчетДоверительногоУправления) КАК СчетДоверительногоУправления,
		|	ПРЕДСТАВЛЕНИЕ(_ОшибкиРасчетаЦены.ЦеннаяБумага) КАК ЦеннаяБумага
		|ИЗ
		|	_ОшибкиРасчетаЦены КАК _ОшибкиРасчетаЦены
		|
		|УПОРЯДОЧИТЬ ПО
		|	_ОшибкиРасчетаЦены.СчетДоверительногоУправления,
		|	_ОшибкиРасчетаЦены.ЦеннаяБумага,
		|	_ОшибкиРасчетаЦены.Дата
		|ИТОГИ ПО
		|	Дата,
		|	СчетДоверительногоУправления
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	ТекстОшибки = "Не удалось определить стоимость ценной бумаги:";
	
	ВыборкаПоДате = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоДате.Следующий() Цикл
		
		ТекстОшибки = ТекстОшибки + СтрШаблон("
			|	%1", Формат(ВыборкаПоДате.Дата, "ДФ=dd.MM.yyyy"));
		
		ВыборкаПоСчетуДУ = ВыборкаПоДате.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоСчетуДУ.Следующий() Цикл
			
			МассивБумаг = Новый Массив;
			
			ВыборкаПоБумаге = ВыборкаПоСчетуДУ.Выбрать();
			Пока ВыборкаПоБумаге.Следующий() Цикл
				МассивБумаг.Добавить(ВыборкаПоБумаге.ЦеннаяБумага);
			КонецЦикла;
			
			ТекстОшибки = ТекстОшибки + СтрШаблон("
				|	- %1: %2", ВыборкаПоСчетуДУ.СчетДоверительногоУправления, СтрСоединить(МассивБумаг, ", ")); 
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТекстОшибки;
	
КонецФункции

Процедура ЗарегистрироватьОшибки(ОписаниеОшибки, Ошибки = Неопределено, СистемнаяОшибка = Истина)
	
	РегистрируемыеОшибки = РаботаСКоллекциями.ЗначениеВМассив(ОписаниеОшибки);
	
	Если Ошибки <> Неопределено Тогда
		РаботаСКоллекциями.ДополнитьМассив(РегистрируемыеОшибки, Ошибки); 
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда
		Источник = ЭтотОбъект.ДополнительныеСвойства.Источник;
	Иначе
		Источник = ЭтотОбъект.Метаданные().ПолноеИмя();
	КонецЕсли;
	
	Если СистемныеФункции.ЭтоФоновоеЗадание() Тогда
		
		Если СистемнаяОшибка
			ИЛИ Не ЭтотОбъект.ДополнительныеСвойства.Свойство("РегистрироватьВЖурналеОшибокТолькоСистемныеОшибки")
		Тогда
			РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(РегистрируемыеОшибки, Источник);
		КонецЕсли;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(РегистрируемыеОшибки, Символы.ПС));
		
	КонецЕсли;		
	
	// Запоминаем зарегистрированные ошибки
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗарегистрированныеОшибки") Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ЗарегистрированныеОшибки", Новый Массив);
	КонецЕсли;
	
	РаботаСКоллекциями.ДополнитьМассив(ЭтотОбъект.ДополнительныеСвойства.ЗарегистрированныеОшибки, РегистрируемыеОшибки); 
	
КонецПроцедуры

#КонецОбласти

ДополнительныеСвойства = Новый Структура;
